Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To enforce CORS policies in your application, enable the Quarkus CORS filter by adding the following line to the `src/main/resources/application.properties` file:
ja_jp: アプリケーションで CORS ポリシーを適用するには、`src/main/resources/application.properties` ファイルに次の行を追加して、Quarkus CORS フィルターを有効にします。

source: To enforce CORS policies in your application, enable the Quarkus CORS filter with the `io.quarkus.vertx.http.security.HttpSecurity` CDI event:
ja_jp: アプリケーションで CORS ポリシーを適用するには、`io.quarkus.vertx.http.security.HttpSecurity` CDI イベントを使用して Quarkus CORS フィルターを有効にします。

source: To ensure consistent behavior, Quarkus Messaging disables the propagation of any context during message dispatching through inbound or outbound connectors. This means that context captured through Emitters won't be propagated to the outgoing channel, and incoming channels won't dispatch messages by activating a context (e.g. the request context). This behaviour can be configured using `quarkus.messaging.connector-context-propagation` configuration property, by listing the context types to propagate. For example `quarkus.messaging.connector-context-propagation=CDI` will only propagate the CDI context.
ja_jp: 一貫した動作を確保するため、Quarkus Messaging は、インバウンドまたはアウトバウンドコネクターを介したメッセージディスパッチ中のコンテキスト伝搬を無効にします。これは、Emitter を介してキャプチャされたコンテキストが送信チャネルに伝搬されず、着信チャネルがコンテキストをアクティブ化することによってメッセージをディスパッチしない (例: リクエストコンテキスト) ことを意味します。この動作は、伝搬するコンテキストのタイプをリストすることで、`quarkus.messaging.connector-context-propagation` 設定プロパティーを使用して設定できます。たとえば、`quarkus.messaging.connector-context-propagation=CDI` は CDI コンテキストのみを伝搬します。

source: To ensure data integrity in case of application crashes or failures, enable the transaction crash recovery with the `quarkus.transaction-manager.enable-recovery=true` configuration.
ja_jp: アプリケーションのクラッシュや障害が発生した場合にデータの整合性を確保するには、 `quarkus.transaction-manager.enable-recovery=true` 設定でトランザクションのクラッシュリカバリを有効にします。

source: To ensure fast startup times, only 100 random heroes from the https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-heroes.sql[3,458 total available heroes^] are loaded into the database. If you'd like to load more data, grab the https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-heroes.sql[`+all-heroes.sql+` from the `+characterdata+` branch in the repo^]. Copy the data into https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-heroes/src/main/resources/import.sql[`+rest-heroes/src/main/resources/import.sql+`^] as well as into https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-heroes/deploy/db-init/initialize-tables.sql[`+rest-heroes/deploy/db-init/initialize-tables.sql+`^].
ja_jp: 起動時間を短縮するために、 link:https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-heroes.sql[利用可能な全ヒーロー3,458, window=_blank]体の中から100体のランダムなヒーローだけがデータベースに読み込まれます。より多くのデータをロードしたい場合は、 link:https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-heroes.sql[レポの `characterdata` ブランチから `all-heroes.sql`, window=_blank] を取得してください。そのデータを link:https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-heroes/src/main/resources/import.sql[`rest-heroes/src/main/resources/import.sql`, window=_blank]と同様に link:https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-heroes/deploy/db-init/initialize-tables.sql[`rest-heroes/deploy/db-init/initialize-tables.sql`, window=_blank] にコピーしてください。

source: To ensure fast startup times, only 100 random villains from the https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-villains.sql[1,797 total available villains^] are loaded into the database. If you'd like to load more data, grab the https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-villains.sql[`+all-villains.sql+` from the `+characterdata+` branch in the repo^]. Copy the data into https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-villains/src/main/resources/import.sql[`+rest-villains/src/main/resources/import.sql+`^] as well as into https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-villains/deploy/db-init/initialize-tables.sql[`+rest-villains/deploy/db-init/initialize-tables.sql+`^].
ja_jp: 起動時間を短縮するために、 link:https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-villains.sql[1,797, window=_blank]体の悪役の中から100体のランダムな悪役だけをデータベースにロードしています。もっと多くのデータをロードしたい場合は、 link:https://github.com/quarkusio/quarkus-super-heroes/blob/characterdata/all-villains.sql[レポの `characterdata` ブランチから `all-villains.sql`, window=_blank] を取得してください。そのデータを link:https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-villains/src/main/resources/import.sql[`rest-villains/src/main/resources/import.sql`, window=_blank]にコピーし、さらに link:https://github.com/quarkusio/quarkus-super-heroes/blob/main/rest-villains/deploy/db-init/initialize-tables.sql[`rest-villains/deploy/db-init/initialize-tables.sql`, window=_blank].

source: To ensure full-compability with `native-image`, it is recommended to apply the Jackson `@field:JsonProperty("fieldName")` annotation, and set a nullable default, as illustrated below. You can automate the generation of Kotlin data classes for your sample JSON using Intellij plugins (such as JSON to Kotlin Class), and easily enable the Jackson annotation and select nullable parameters as part of the auto-code generation.
ja_jp: `native-image` との完全な互換性を確保するためには、Jackson `@field:JsonProperty("fieldName")` アノテーションを適用し、以下の図のように nullable のデフォルトを設定することをお勧めします。Intellijのプラグイン（JSON to Kotlin Classなど）を使用して、サンプルのJSONに対するKotlinデータクラスの生成を自動化し、Jacksonアノテーションを有効にして、自動コード生成の一部としてnullableパラメータを選択することができます。

source: To ensure full-compatibility with `native-image`, it is recommended to apply the Jackson `@field:JsonProperty("fieldName")` annotation, and set a nullable default, as illustrated below. You can automate the generation of Kotlin data classes for your sample JSON using IntelliJ IDEA plugins (such as JSON to Kotlin Class), and easily enable the Jackson annotation and select nullable parameters as part of the auto-code generation.
ja_jp: `native-image` との完全な互換性を確保するためには、Jackson `@field:JsonProperty("fieldName")` アノテーションを適用し、以下の図のように nullable のデフォルトを設定することをお勧めします。Intellijのプラグイン（JSON to Kotlin Classなど）を使用して、サンプルのJSONに対するKotlinデータクラスの生成を自動化し、Jacksonアノテーションを有効にして、自動コード生成の一部としてnullableパラメータを選択することができます。

source: To ensure secure client-server communication, the client is often required to verify the server's authenticity.
ja_jp: クライアントとサーバー間のセキュアな通信を確保するには、多くの場合、クライアントがサーバーの信頼性を検証する必要があります。

source: To ensure that your content shows up correctly on the link:https://quarkus.io/guides/[Quarkus documentation home page], use the following steps:
ja_jp: link:https://quarkus.io/guides/[Quarkusドキュメントホームページ] にコンテンツが正しく表示されるようにするには、次のステップを使用します:

source: To ensure your application uses the new certificate, you can use the periodic reloading feature of the Quarkus TLS registry.
ja_jp: アプリケーションが新しい証明書を使用するようにするには、Quarkus TLS レジストリーの定期的な再読み込み機能を使用できます。

source: To establish a TLS connection, you need to configure a _named_ configuration using the xref:./tls-registry-reference.adoc[TLS registry]. This is typically done via configuration:
ja_jp: TLS 接続を確立するには、xref:./tls-registry-reference.adoc[TLS レジストリー] を使用して、_名前付き_ の設定を設定する必要があります。これは通常、設定を介して行われます。

source: To establish a TLS connection, you need to configure a _named_ configuration using the xref:./tls-registry-reference.adoc[TLS registry]:
ja_jp: TLS 接続を確立するには、xref:./tls-registry-reference.adoc[TLS レジストリー] を使用して、_名前付き_ の設定を設定する必要があります。

source: To examine the completed example, download the {quickstarts-archive-url}[archive] or clone the Git repository:
ja_jp: 完了した例を確認するには、{quickstarts-archive-url}[アーカイブ] をダウンロードするか、Git リポジトリーのクローンを作成します。

source: To exclude only a particular datasource from the health check, use:
ja_jp: 特定のデータソースだけをヘルスチェックから除外するには、次のようにします：

source: To exclude only a particular datasource from the health check:
ja_jp: 特定のデータソースのみをヘルスチェックから除外するには、以下を使用します。

source: To execute a custom command, or a command not supported by the API, use the following approach:
ja_jp: カスタムコマンドや API でサポートされていないコマンドを実行するには、以下の方法を使用します。

source: To execute the `double` function defined in link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] invoke this curl script:
ja_jp: link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義されている `double` 関数を実行するには、次のcurlスクリプトを実行します：

source: To execute the `double` function defined in {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] invoke this curl script:
ja_jp: {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義されている `double` Function を実行するには、この curl スクリプトを呼び出します。

source: To execute the application created in xref:writing-an-application_{context}[Writing an application], do the following:
ja_jp: xref:writing-an-application_{context}[アプリケーションの作成] で作成したアプリケーションを実行するには、次のようにします:

source: To execute the application created in xref:writing-an-application_{context}[], do the following:
ja_jp: xref:writing-an-application_{context}[] で作成したアプリケーションを実行するには、次のようにします:

source: To execute the queries, you need to send GET requests to our REST endpoint:
ja_jp: クエリを実行するには、RESTエンドポイントにGETリクエストを送信する必要があります:

source: To explicitly define the target architecture run `native-image -march=list` to get the supported configurations and then set `-march` to one of them, e.g., `quarkus.native.additional-build-args=-march=x86-64-v4`. If you are targeting an AMD64 host, `-march=x86-64-v2` would work in most cases.
ja_jp: ターゲット・アーキテクチャを明示的に定義するには、 `native-image -march=list` を実行してサポートされている構成を取得し、 `-march` をそのうちの1つ、たとえば `quarkus.native.additional-build-args=-march=x86-64-v4` を設定します。AMD64ホストをターゲットにしている場合は、ほとんどの場合、 `-march=x86-64-v2` で動作します。

source: To explicitly en-/disable this feature, set the `quarkus.generate-code.grpc.kotlin.generate` property in your `application.properties` file to `true` or `false`.
ja_jp: この機能を明示的に有効/無効にするには、 `application.properties` ファイルの `quarkus.generate-code.grpc.kotlin.generate` プロパティを `true` または `false` に設定します。

source: To expose a `Route` for the Quarkus application:
ja_jp: Quarkusアプリケーションの `Route` を公開するには次のようにします。

source: To expose a route to the application, run the following command:
ja_jp: アプリケーションへのルートを公開するには、以下のコマンドを実行します:

source: To expose an endpoint on the management interface from the code of an application, refer to xref:#management-endpoint-application[the application section].
ja_jp: アプリケーションのコードからマネジメントインタフェースのエンドポイントを公開するには、 xref:management-endpoint-application[アプリケーションのセクション] を参照してください。

source: To expose information about your application (such as the git hash), add the `quarkus-info` extension to your project.
ja_jp: アプリケーションに関する情報（gitハッシュなど）を公開するには、 `quarkus-info` エクステンションをプロジェクトに追加します。

source: To expose recorded values (data produced at runtime by a recorder) as an MCP resource, define a xref:dev-ui.adoc#jsonrpc-against-a-recorded-value[build‑time action] in the deployment module. The action must include a description:
ja_jp: 記録された値 (レコーダーによって実行時に生成されたデータ) を MCP リソースとして公開するには、デプロイメントモジュールで xref:dev-ui.adoc#jsonrpc-against-a-recorded-value[ビルド時アクション] を定義します。アクションには説明を含める必要があります。

source: To expose runtime information or actions (for example, changing log levels), define a xref:dev-ui.adoc#jsonrpc-against-the-runtime-classpath[JSON‑RPC service] in your runtime or runtime‑dev module and annotate the methods and parameters with `@JsonRpcDescription`:
ja_jp: 実行時の情報やアクション (ログレベルの変更など) を公開するには、ランタイムモジュールまたは runtime-dev モジュールで xref:dev-ui.adoc#jsonrpc-against-the-runtime-classpath[JSON‑RPC サービス] を定義し、メソッドとパラメーターに `@JsonRpcDescription` アノテーションを付けます。

source: To expose the contents of a `static/` directory:
ja_jp: `static/` ディレクトリーの内容を公開するには、以下のようにします。

source: To expose the service and create an {openshift} route, set the following property:
ja_jp: サービスを公開し、 {openshift} ルートを作成するには、以下のプロパティを設定します：

source: To extract the required ssl, you must start up a Docker container in the background, and attach to that container to copy the artifacts.
ja_jp: 必要な SSL を抽出するには、バックグラウンドでDockerコンテナーを起動し、そのコンテナーにアタッチしてアーティファクトをコピーする必要があります。

source: To facilitate the configuration, you can use the `@RegisterRestClient` `configKey` property that allows to use another configuration root than the fully qualified name of your interface.
ja_jp: 構成を容易にするために、 `@RegisterRestClient` `configKey` プロパティーを使用して、インターフェイスの完全修飾名とは別の構成ルートを使用することができます。

source: To facilitate the configuration, you can use the `@RegisterRestClient` `configKey` property that allows to use different configuration root than the fully qualified name of your interface.
ja_jp: 設定を容易にするために、 `@RegisterRestClient` `configKey` プロパティーを使用して、インターフェイスの完全修飾名とは別の設定ルートを使用することができます。

source: To facilitate the storage of transaction logs in a database by using JDBC, see xref:transaction.adoc#jdbcstore[Configuring transaction logs to be stored in a datasource] section of the xref:transaction.adoc[Using transactions in Quarkus] guide.
ja_jp: jdbcを使用してトランザクションログをデータベースに保存しやすくするには、 xref:transaction.adoc[Quarkusのトランザクションの使用] ガイドの xref:transaction.adoc#jdbcstore[トランザクションログをデータソースに保存するように設定する] セクションを参照してください。

source: To find out more about Infinispan, visit the https://infinispan.org/documentation[Infinispan documentation].
ja_jp: Infinispanの詳細については、 link:https://infinispan.org/documentation[Infinispanのドキュメント]をご覧ください。

source: To find out more on how the <<quarkus-hibernate-orm_quarkus-hibernate-orm-validation-mode,`quarkus.hibernate-orm.validation.mode` configuration property>>. influence your Hibernate Reactive application see the xref:hibernate-orm.adoc#validator_integration[corresponding Hibernate ORM guide], as these modes work the same in both cases.
ja_jp: <<quarkus-hibernate-orm_quarkus-hibernate-orm-validation-mode,`quarkus.hibernate-orm.validation.mode` 設定プロパティー>> が Hibernate Reactive アプリケーションにどのように影響を与えるかについてさらに詳しく知るには、xref:hibernate-orm.adoc#validator_integration[対応する Hibernate ORM ガイド] を参照してください。これらのモードはどちらの場合でも同じように機能するためです。

source: To find out, we collected some numbers for two different Quarkus applications:
ja_jp: それを調べるために、2 つの異なる Quarkus アプリケーションについていくつかの数値を収集しました。

source: To finish the LRA restart the failed service (which was listening on port 8080):
ja_jp: LRAを終了するために、失敗したサービス（ポート8080で待ち受けていた）を再起動します。

source: To fix classpath, class initialization or forbidden API errors at build time it's best to use <<native-reports,build time reports>> to understand the closed world universe. A complete picture of the universe, along with the relationships between the different classes and methods will help uncover and fix most of the issues.
ja_jp: ビルド時にクラスパス、クラスの初期化、または禁止された API エラーを修正するには、<<native-reports,build time reports>> を使用して、閉ざされた世界を理解するのが最善です。さまざまなクラスとメソッド間の関係とともに、世界全体像を把握することで、ほぼすべての問題を発見して修正することができます。

source: To fix classpath, class initialization or forbidden API errors at build time it's best to use xref:native-reports[build time reports] to understand the closed world universe. A complete picture of the universe, along with the relationships between the different classes and methods will help uncover and fix most of the issues.
ja_jp: ビルド時にクラスパス、クラス初期化、禁則APIエラーを修正するには、 xref:native-reports[ビルド時レポート] を使用して、閉じた世界の宇宙を理解するのが最善です。異なるクラスやメソッド間の関係とともに、世界の全体像を把握することで、ほとんどの問題を発見し解決することができます。

source: To fix runtime native specific errors, it's best to have <<debug-info,debug info builds>> of the native executables around, so that `gdb` can be hooked up quickly to debug the issue. If you also add local symbols to the debug info builds, you will obtain precise <<profiling,profiling information>> as well.
ja_jp: ランタイムのネイティブ特有のエラーを修正するには、ネイティブ実行可能ファイルの <<debug-info,debug info builds>> を用意しておくと、 `gdb` を素早くフックして問題をデバッグすることができます。デバッグ情報ビルドにローカルシンボルも追加すると、正確な <<profiling,profiling information>> が得られます。

source: To fix runtime native specific errors, it's best to have xref:debug-info[debug info builds] of the native executables around, so that `gdb` can be hooked up quickly to debug the issue. If you also add local symbols to the debug info builds, you will obtain precise xref:profiling[profiling information] as well.
ja_jp: 実行時のネイティブ特有のエラーを修正するには、ネイティブ実行可能ファイルの xref:debug-info[デバッグ情報ビルド] を用意しておくと良いでしょう。 `gdb` がフックされることが出来、問題のデバッグを迅速に行うことができます。デバッグ情報ビルドにローカルシンボルも追加すれば、正確な xref:profiling[プロファイリング] 情報も得られます。

source: To fix the tests, open `src/test/java/org/acme/GreetingResourceTest.java` and replace
ja_jp: テストを修正するには `src/test/java/org/acme/GreetingResourceTest.java` を開き、 以下を

source: To follow the tutorial, you may want to use only one machine (localhost) and skip the ssh authentication setup. This can be easily achieved by using the following inventory file:
ja_jp: チュートリアルに従うには、1台のマシン（localhost）だけを使用し、ssh認証のセットアップをスキップしたいかもしれません。これは、以下のインベントリファイルを使用することで簡単に実現できます：

source: To fulfill our requirements, let's create the following implementation:
ja_jp: 要件を満たすために、次のような実装を作ってみましょう:

source: To fully customize the Vert.x HTTP Client instance that the REST Client Reactive is internally using, you can provide your custom HTTP Client Options instance via CDI or when programmatically creating your client.
ja_jp: REST Client Reactive が内部で使用している Vert.x HTTP Client インスタンスを完全にカスタマイズするには、 カスタム HTTP Client Options インスタンスを CDI 経由またはプログラムによるクライアント作成時に変更できます。

source: To fully customize the Vert.x HTTP Client instance that the REST Client is internally using, you can provide your custom HTTP Client Options instance via CDI or when programmatically creating your client.
ja_jp: REST Client が内部的に使用している Vert.x HTTP Client インスタンスを完全にカスタマイズするには、CDI 経由で、またはプログラムでクライアントを作成するときに、HTTP Client Options インスタンスを提供します。

source: To fully enable the close world assumptions that Quarkus can optimize best, it is better to consider configuration options as build time settled vs overridable at runtime. Of course properties like host, port, password should be overridable at runtime. But many properties like enable caching or setting the JDBC driver can safely require a rebuild of the application.
ja_jp: Quarkusが最適化できる閉じた世界の仮定を完全に有効にするには、ビルド時に設定された設定オプションと実行時にオーバーライド可能な設定オプションのどちらを採用するか検討するべきでしょう。もちろん、ホスト、ポート、パスワードなどのプロパティは、実行時にオーバーライド可能でなければなりません。しかし、キャッシングを有効にしたり、JDBCドライバを設定したりするような多くのプロパティは、アプリケーションの再構築を安全に要求することができます。

source: To generate JWT tokens, copy `privateKey.pem` from the `integration-tests/oidc-tenancy` in the `main` Quarkus repository and use a test code similar to the one in the preceding <<bearer-token-integration-testing-wiremock>> section. You can use your own test keys, if preferred.
ja_jp: JWT トークンを生成するには、 `main` Quarkus リポジトリーの `integration-tests/oidc-tenancy` から `privateKey.pem` をコピーし、前述の <<bearer-token-integration-testing-wiremock>> セクションと同様のテストコードを使用します。 必要に応じて、独自のテストキーを使用することもできます。

source: To generate a certificate, add his annotation to your already created OpenShift `service`:
ja_jp: 証明書を生成するには、すでに作成されている OpenShift `service` に次のアノテーションを追加します。

source: To generate a certificate, add this annotation to your existing OpenShift `service`:
ja_jp: 証明書を生成するには、既存の OpenShift `service` にこのアノテーションを追加します。

source: To generate a configuration section of a given group, use the `@ConfigDocSection` annotation:
ja_jp: 指定したグループの設定セクションを生成するには、 `@ConfigDocSection` アノテーションを使用してください:

source: To generate a development CA:
ja_jp: 開発用 CA を生成するには、次のように指定します。

source: To generate a new extension with a Codestart skeleton provide the `-DwithCodestart` flag to this Mojo:
ja_jp: Codestartスケルトンで新しいエクステンションを生成するには、このMojoに `-DwithCodestart` フラグを指定します。

source: To generate a starter project go to https://code.quarkus.io. Enter 'io.quarkus' as Maven Group and 'quarkus-react' as Artifact. In the list of extensions choose *RESTEasy JAX-RS* and *RESTEasy JSON-B*. Then generate and download the project, unzip it on your local machine and open the project folder in your favorite IDE.
ja_jp: スタータープロジェクトを生成するには、 https://code.quarkus.io にアクセスします。Maven Groupとして "io.quarkus" 、Artifactとして "quarkus-react" を入力します。エクステンションのリストで、 *RESTEasy JAX-RS* と *RESTEasy JSON-B* を選択します。その後、プロジェクトを生成してダウンロードし、ローカル・マシンで解凍して、お気に入りのIDEでプロジェクト・フォルダを開きます。

source: To generate debug symbols, add `-Dquarkus.native.debug.enabled=true` flag when generating the native executable. You will find the debug symbols for the native executable in a `.debug` file next to the native executable.
ja_jp: デバッグシンボルを生成するには、ネイティブ実行可能ファイルの生成時に `-Dquarkus.native.debug.enabled=true` フラグを追加してください。ネイティブ実行可能ファイルのデバッグシンボルは、ネイティブ実行可能ファイルの隣にある `.debug` ファイルにあります。

source: To generate gRPC classes, Quarkus uses the `protoc` artifact from the `com.google.protobuf` group id. However, to ensure the support of various platforms, Quarkus automatically downloads _all_ the possible variants of the `protoc` artifact. In addition, Quarkus downloads both `protoc` and the plugin used to generate gRPC classes in Java. For example, even if you are using Linux, Quarkus downloads the `protoc` and the Java plugin artifacts for Windows and MacOS.
ja_jp: gRPC クラスを生成するために、Quarkus は `com.google.protobuf` グループ ID の `protoc` アーティファクトを使用します。 ただし、さまざまなプラットフォームのサポートを確実にするために、Quarkus は `protoc` アーティファクトの可能な _すべて_ のバリアントを自動的にダウンロードします。 さらに、Quarkus は `protoc` と、Java で gRPC クラスを生成するために使用されるプラグインの両方をダウンロードします。 たとえば、Linux を使用している場合でも、Quarkus は Windows および MacOS 用の `protoc` と Java プラグインアーティファクトをダウンロードします。

source: To generate the documentation:
ja_jp: ドキュメントを生成するには次を実施します:

source: To get a behavior closer to the specification, these features should be disabled.
ja_jp: 仕様に近い動作を得るには、これらの機能を無効にする必要があります。

source: To get access to your application beans and services, be aware that a `@QuarkusMain` instance is an application scoped bean by default. It has access to singletons, application and dependent scoped beans.
ja_jp: アプリケーションBeanやサービスにアクセスするために、 `@QuarkusMain` インスタンスはデフォルトでapplicationスコープのBeanであることに注意してください。singleton、application、dependentスコープのBeanへのアクセスを持っています。requestスコープを必要とするBeanと対話したい場合は、 `run()` メソッドに `@ActivateRequestContext` を記述してください。

source: To get an application logger in {project-name}, select one of the following approaches.
ja_jp: {project-name} でアプリケーションロガーを取得するには、次のいずれかのアプローチを選択します。

source: To get around this Quarkus supports the idea of a test profile. If a test has a different profile to the previously run test then Quarkus will be shut down and started with the new profile before running the tests. This is obviously a bit slower, as it adds a shutdown/startup cycle to the test time, but gives a great deal of flexibility.
ja_jp: この問題を回避するために、Quarkusはテストプロファイルの考え方をサポートしています。以前に実行したテストとは異なるプロファイルを持つテストがある場合、Quarkusはテストを実行する前にシャットダウンされ、新しいプロファイルで開始されます。これは、テスト時間にシャットダウン/起動サイクルが追加されるため、明らかに少し遅くなりますが、非常に大きな柔軟性が得られます。

source: To get code coverage data from integration tests, the following need to be requirements need to be met:
ja_jp: 統合テストからコードカバレッジデータを取得するためには、以下のような要件を満たす必要があります:

source: To get code coverage data from integration tests, the following requirements need to be met:
ja_jp: 結合テストからコードカバレッジデータを取得するには、以下の要件を満たす必要があります:

source: To get hold of these, simply query the extension context object for given key. Note that these metadata are made available as build proceeds which means that extensions can only leverage metadata that were built before the extensions are invoked. If your extension attempts to retrieve metadata that wasn't yet produced, `null` will be returned. Here is a summary of which extensions can access which metadata:
ja_jp: これらのメタデータを取得するには、そのキーのエクステンションコンテキストオブジェクトをクエリするだけ可能です。これらのメタデータはビルドが進むにつれて利用可能になることに注意してください。エクステンションがまだ生成されていないメタデータを取得しようとすると、 `null` が返されます。どのエクステンションがどのメタデータにアクセスできるかをまとめてみました。
